dataset_gen/NS_datasets/FPO_cylinder/Irregular/Design_Point_0/0/C
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
16128
(
(0.25 0.25 0.05)
(0.75 0.25 0.05)
(1.25 0.25 0.05)
(1.75 0.25 0.05)
(2.25 0.25 0.05)
(2.75 0.25 0.05)
(3.25 0.25 0.05)
(3.75 0.25 0.05)
...
)
;

boundaryField
{
    left
    {
        type            calculated;
        value           nonuniform List<vector> 
128
(
(0 0.25 0.05)
(0 0.75 0.05)
(0 1.25 0.05)
(0 1.75 0.05)
(0 2.25 0.05)
(0 2.75 0.05)
(0 3.25 0.05)
(0 3.75 0.05)
...
)
;
    }
    right
    {
        type            calculated;
        value           nonuniform List<vector> 
128
(
(64 0.25 0.05)
(64 0.75 0.05)
(64 1.25 0.05)
(64 1.75 0.05)
(64 2.25 0.05)
(64 2.75 0.05)
(64 3.25 0.05)
(64 3.75 0.05)
...
)
;
    }
    bottom
    {
        type            calculated;
        value           nonuniform List<vector> 
128
(
(0.25 0 0.05)
(0.75 0 0.05)
(1.25 0 0.05)
(1.75 0 0.05)
(2.25 0 0.05)
(2.75 0 0.05)
(3.25 0 0.05)
(3.75 0 0.05)
...
)
;
    }
    top
    {
        type            calculated;
        value           nonuniform List<vector> 
128
(
(0.25 64 0.05)
(0.75 64 0.05)
(1.25 64 0.05)
(1.75 64 0.05)
(2.25 64 0.05)
(2.75 64 0.05)
(3.25 64 0.05)
(3.75 64 0.05)
...
)
;
    }
    hole
    {
        type            calculated;
        value           nonuniform List<vector> 
64
(
(28.25 28 0.05)
(28.75 28 0.05)
(29.25 28 0.05)
(29.75 28 0.05)
(30.25 28 0.05)
(30.75 28 0.05)
(31.25 28 0.05)
(31.75 28 0.05)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
