dataset_gen/NS_datasets/FPO_cylinder/Irregular/Design_Point_0/0/Cx
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
16128
(
0.25
0.75
1.25
1.75
2.25
2.75
3.25
3.75
...
)
;

boundaryField
{
    left
    {
        type            calculated;
        value           uniform 0;
    }
    right
    {
        type            calculated;
        value           uniform 64;
    }
    bottom
    {
        type            calculated;
        value           nonuniform List<scalar> 
128
(
0.25
0.75
1.25
1.75
2.25
2.75
3.25
3.75
...
)
;
    }
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
128
(
0.25
0.75
1.25
1.75
2.25
2.75
3.25
3.75
...
)
;
    }
    hole
    {
        type            calculated;
        value           nonuniform List<scalar> 
64
(
28.25
28.75
29.25
29.75
30.25
30.75
31.25
31.75
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
